# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P2-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3, [128, True]] #2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C3, [256, True]] #4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C3, [512, True]] #6 
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C3STR, [1024, True]] #8
  - [-1, 1, SPPF, [1024, 5]] # 9
#24
# YOLOv8.0-p2 head
head:
  - [-1, 1, Conv, [512, 1, 1]] #10
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #11
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4 #12 맞는데
  - [-1, 3, C3, [512]] # 13
  - [-1, 1, CBAM, [512,7]] # 14

  - [-1, 1, Conv, [256, 1, 1]] #15
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #16
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3 #17 #맞고
  - [-1, 3, C3, [256]] # 18 (P3/8-small) 
  - [-1, 1, CBAM, [256,7]] # 19

  - [-1, 1, Conv, [128, 1, 1]] #20
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #21
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2 #22 # 맞고
  - [-1, 1, C3STR, [128]] # 23 (P2/4-xsmall)
  - [-1, 1, CBAM, [128,7]] # 24

  - [-1, 1, Conv, [128, 3, 2]] #25
  - [[-1, 20], 1, Concat, [1]] # cat head P3 #26 # 맞고
  - [-1, 1, C3STR, [256]] # 27 (P3/8-small)
  - [-1, 1, CBAM, [256,7]] # 28

  - [-1, 1, Conv, [256, 3, 2]] #29
  - [[-1, 15], 1, Concat, [1]] # cat head P4 #30 #맞고
  - [-1, 2, C3STR, [512]] # 31 (P4/16-medium) 
  - [-1, 1, CBAM, [512,7]] # 32
 
  - [-1, 1, Conv, [512, 3, 2]] #33
  - [[-1, 10], 1, Concat, [1]] # cat head P5 #34 # 맞고
  - [-1, 3, C3STR, [1024]] # 35 (P5/32-large)

  - [[23, 27, 31, 35], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)
